Case #1: 4.6666666667
4.6666666667
Case #2: 355.0750000000
355.0750000000
Data dimensions: (24935, 46)
Model: "Initial_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 512)               22528     
_________________________________________________________________
dense_1 (Dense)              (None, 512)               262656    
_________________________________________________________________
dense_2 (Dense)              (None, 256)               131328    
_________________________________________________________________
dense_3 (Dense)              (None, 256)               65792     
_________________________________________________________________
dense_4 (Dense)              (None, 128)               32896     
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 129       
=================================================================
Total params: 515,329
Trainable params: 515,329
Non-trainable params: 0
_________________________________________________________________
Epoch 1/200
 1/20 [>.............................] - ETA: 0s - loss: 11264.4014 2/20 [==>...........................] - ETA: 0s - loss: 11251.4336 3/20 [===>..........................] - ETA: 0s - loss: 11214.8232 4/20 [=====>........................] - ETA: 0s - loss: 11176.4277 5/20 [======>.......................] - ETA: 0s - loss: 11186.2402 6/20 [========>.....................] - ETA: 0s - loss: 11199.1084 7/20 [=========>....................] - ETA: 0s - loss: 11199.5293 8/20 [===========>..................] - ETA: 0s - loss: 11192.5049 9/20 [============>.................] - ETA: 0s - loss: 11170.767610/20 [==============>...............] - ETA: 0s - loss: 11167.392611/20 [===============>..............] - ETA: 0s - loss: 11179.077112/20 [=================>............] - ETA: 0s - loss: 11177.093813/20 [==================>...........] - ETA: 0s - loss: 11176.936514/20 [====================>.........] - ETA: 0s - loss: 11158.515615/20 [=====================>........] - ETA: 0s - loss: 11144.612316/20 [=======================>......] - ETA: 0s - loss: 11151.8232